index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-09-16 Fri 16:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Load Forecasting with NumPyro</title>
<meta name="author" content="Matt Brigida, Ph.D." />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Load Forecasting with NumPyro</h1>
<div class="org-src-container">
<pre class="src src-python" id="orgdda266c"><span style="color: #c099ff;">import</span> numpyro <span style="color: #c099ff;">as</span> py
<span style="color: #c099ff;">import</span> pandas <span style="color: #c099ff;">as</span> pd
</pre>
</div>

<p>
We can pull real-time load data from the following URL.  The example URL pulls data for 7/3/2022.
</p>

<p>
<a href="http://mis.nyiso.com/public/csv/pal/20220703pal.csv">http://mis.nyiso.com/public/csv/pal/20220703pal.csv</a>
</p>


<p>
Let's create a function that will pull data for a few days before the date we want to forecast.
</p>

<div class="org-src-container">
<pre class="src src-python" id="org37809dc"><span style="color: #c099ff;">def</span> <span style="color: #82aaff;">get_data</span>(date):    <span style="color: #7a88cf;"># </span><span style="color: #7a88cf;">in yyyymmdd format</span>
    <span style="color: #ff98a4;">url</span> = <span style="color: #c3e88d;">"http://mis.nyiso.com/public/csv/pal/"</span> + <span style="color: #c099ff;">str</span>(date) + <span style="color: #c3e88d;">"pal.csv"</span>
    <span style="color: #ff98a4;">data</span> = pd.read_csv(url)
    <span style="color: #c099ff;">return</span>(data)
</pre>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Matt Brigida, Ph.D.</p>
<p class="date">Created: 2022-09-16 Fri 16:00</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
